doc: 更新API文档
